adpyke.codesnap
alexnesnes.teleplot
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
chadalen.vscode-jetbrains-icon-theme
christian-kohler.npm-intellisense
davidbwaters.macos-modern-theme
ecmel.vscode-html-css
esbenp.prettier-vscode
gera2ld.markmap-vscode
github.copilot
github.copilot-chat
l-igh-t.vscode-theme-seti-folder
llvm-vs-code-extensions.lldb-dap
miguelsolorio.symbols
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
platformio.platformio-ide
pranaygp.vscode-css-peek
rangav.vscode-thunder-client
ritwickdey.liveserver
samplavigne.p5-vscode
shd101wyy.markdown-preview-enhanced
slevesque.shader
swiftlang.swift-vscode
tomoki1207.pdf
twxs.cmake
vadimcn.vscode-lldb
vscodevim.vim
